"""
6. * Реализовать структуру данных «Товары».
Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]
Необходимо собрать аналитику о товарах.
Реализовать словарь, в котором каждый ключ — характеристика товара,
например название, а значение — список значений-характеристик,
например список названий товаров.
Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
"""
my_dict = {}

user_name = []
user_price = []
user_quality = []
user_unit = []

dict_name = "назввание"
dict_price = "цена"
dict_quality = "количество"
dict_unit = "ед."

my_analytics_dict = {dict_name: user_name, dict_price: user_price, dict_quality: user_quality, dict_unit: user_unit}

my_tuple1 = (1, my_dict)
my_tuple2 = (2, my_dict)
my_tuple3 = (3, my_dict)

my_list = [my_tuple1, my_tuple2, my_tuple3]



for x in my_list:
    name = input("Введите название товара: ").lower()
    my_dict[dict_name] = name
    user_name.append(name)
    price = int(input("Введите цену товара в рублях: "))
    my_dict[dict_price] = price
    user_price.append(price)
    quality = int(input("Введите количество товара (в цифрах): "))
    my_dict[dict_quality] = quality
    user_quality.append(quality)
    unit = input("Введите единицу измерения(шт.): ").lower()
    my_dict[dict_unit] = unit
    user_unit.append(unit)

print("Данные товаров:", my_list)
print("Аналитика товаров:", my_analytics_dict)





